---
kind: property
id: P:Autodesk.Revit.UI.ContextualHelp.HelpPath
source: html/d0d586a5-996f-9883-6500-c3dce5f316d9.htm
---
# Autodesk.Revit.UI.ContextualHelp.HelpPath Property

The context id, help URL, or help file path.

## Syntax (C#)
```csharp
public string HelpPath { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when setting the help path to null or empty.